export const dictionary = {
  'en': {
    staticInfo: {
      coordinates: {
        lat: 'Latitude',
        log: 'Longitude'
      },
      search: 'Search',
      placeholder: 'Search city',
      weatherInfo: {
        feelsLike: 'FEELS LIKE',
        wind: 'wind',
        humidity: 'HUMIDITY'
      }
    },
    descriptionWeather: {
      '200':	'Thunderstorm with light rain',
      '201':	'Thunderstorm with rain',
      '202':	'Thunderstorm with heavy rain',
      '230':	'Thunderstorm with light drizzle',
      '231':	'Thunderstorm with drizzle',
      '232':	'Thunderstorm with heavy drizzle',
      '233':	'Thunderstorm with Hail',
      '300':	'Light Drizzle',
      '301':	'Drizzle',
      '302':	'Heavy Drizzle',
      '500':	'Light Rain',
      '501':	'Moderate Rain',
      '502':	'Heavy Rain',
      '511':	'Freezing rain',
      '520':	'Light shower rain',
      '521':	'Shower rain',
      '522':	'Heavy shower rain',
      '600':	'Light snow',
      '601':	'Snow',
      '602':	'Heavy Snow',
      '610':	'Mix snow/rain',
      '611':	'Sleet',
      '612':	'Heavy sleet',
      '621':	'Snow shower',
      '622':	'Heavy snow shower',
      '623':	'Flurries',
      '700':	'Mist',
      '711':  'Smoke',
      '721':	'Haze',
      '731':	'Sand/dust',
      '741':	'Fog',
      '751':	'Freezing Fog',
      '800':	'Clear sky',
      '801':	'Few clouds',
      '802':	'Scattered clouds',
      '803':	'Broken clouds',
      '804':	'Overcast clouds',
      '900':	'Unknown Precipitation',
    },
    months: {
      '0': 'January',
      '1': 'February',
      '2': 'March',
      '3': 'April',
      '4': 'May',
      '5': 'June',
      '6': 'July',
      '7': 'August',
      '8': 'September',
      '9': 'October',
      '10': 'November',
      '11': 'December',
    },
    days: {
      '0': 'Sun',
      '1': 'Mon',
      '2': 'Tue',
      '3': 'Wed',
      '4': 'Thu',
      '5': 'Fri',
      '6': 'Sat',
    },
    weekDays: {
      '0': 'Sunday',
      '1': 'Monday',
      '2': 'Tuesday',
      '3': 'Wednesday',
      '4': 'Thursday',
      '5': 'Friday',
      '6': 'Saturday',
    }
  },
  'ru': {
    staticInfo: {
      coordinates: {
      lat: 'Широта',
      log: 'Долгота'
    },
    search: 'Поиск',
    placeholder: 'Поиск города',
    weatherInfo: {
      feelsLike: 'ОЩУЩАЕТСЯ КАК',
      wind: 'ВЕТЕР',
      humidity: 'ВЛАЖНОСТЬ'
    }
  },
  descriptionWeather: {
    '200': 'Гроза с небольшим дождем',
    '201': 'Гроза с дождем',
    '202': 'Гроза с проливным дождем',
    '230': 'Гроза с легкой моросью',
    '231': 'Гроза с моросящим дождем',
    '232': 'Гроза с сильным моросящим дождем',
    '233': 'Гроза с градом',
    '300': 'Легкая морось',
    '301': 'Изморось',
    '302': 'Сильная морось',
    '500': 'Легкий дождь',
    '501': 'Умеренный дождь',
    '502': 'Ливень',
    '511': 'Ледяной дождь',
    '520': 'Легкий дождь',
    '521': 'Легкий дождь',
    '522': 'Сильный дождь',
    '600': 'Легкий снег',
    '601': 'Снег',
    '602': 'Снегопад',
    '610': 'Смешанный снег с дождем',
    '611': 'Мокрый снег',
    '612': 'Сильный мокрый снег',
    '621': 'Снегопад',
    '622': 'Сильный снегопад',
    '623': 'Порывы',
    '700': 'Дымка',
    '711': 'Дым',
    '721': 'Мгла',
    '731': 'Песок / пыль',
    '741': 'Туман',
    '751': 'Морозный туман',
    '800': 'Ясно',
    '801': 'Преимущественно ясно',
    '802': 'Преимущественно облачно',
    '803': 'Облачно',
    '804': 'Пасмурно',
    '900': 'Неизвестные осадки',
  },
  months: {
    '0': 'Января',
    '1': 'Февраля',
    '2': 'Марта',
    '3': 'Апреля',
    '4': 'Мая',
    '5': 'Июня',
    '6': 'Июля',
    '7': 'Августа',
    '8': 'Сентября',
    '9': 'Октября',
    '10': 'Ноября',
    '11': 'Декабря',
  },
  days: {
    '0': 'Вс',
    '1': 'Пн',
    '2': 'Вт',
    '3': 'Ср',
    '4': 'Чт',
    '5': 'Пт',
    '6': 'Сб',
  },
  weekDays: {
    '0': 'Воскресенье',
    '1': 'Понедельник',
    '2': 'Вторник',
    '3': 'Среда',
    '4': 'Четверг',
    '5': 'Пятница',
    '6': 'Суббота',
  }
  },
  'be': {
    staticInfo: {
      coordinates: {
      lat: 'Шырата',
      log: 'Даўгата'
    },
    search: 'Пошук',
    placeholder: 'Пошук горада',
    weatherInfo: {
      feelsLike: 'АДЧУВАЕЦЦА ЯК',
      wind: 'ВЕЦЕР',
      humidity: 'ВІЛЬГОТНАСЦЬ'
    }
  },
  descriptionWeather: {
    '200': 'Навальніца з невялікім дажджом',
    '201': 'Навальніца з дажджом',
    '202': 'Навальніца з моцным дажджом',
    '230': 'Навальніца са слабым дажджом',
    '231': 'Навальніца з дробным дажджом',
    '232': 'Навальніца з моцным дажджом',
    '233': 'Навальніца з градам',
    '300': 'Лёгкая морось',
    '301': 'Iмжа',
    '302': 'Моцная морось',
    '500': 'Лёгкі дождж',
    '501': 'Ўмераны дождж',
    '502': 'Лівень',
    '511': 'Ледзяны дождж',
    '520': 'Лёгкі дождж',
    '521': 'Лёгкі дождж',
    '522': 'Моцны дождж',
    '600': 'Лёгкі снег',
    '601': 'Снег',
    '602': 'Снегапад',
    '610': 'Змешаны снег з дажджом',
    '611': 'Мокры снег',
    '612': 'Моцны мокры снег',
    '621': 'Снегапад',
    '622': 'Моцны снегапад',
    '623': 'Парывы',
    '700': 'Смуга',
    '711': 'Дым',
    '721': 'Імгла',
    '731': 'Пясок / пыл',
    '741': 'Туман',
    '751': 'Марозны туман',
    '800': 'Ясна',
    '801': 'Пераважна ясна',
    '802': 'Пераважна воблачна',
    '803': 'Воблачна',
    '804': 'Пахмурна',
    '900': 'Невядомыя ападкі',
  },
  months: {
    '0': 'Студзеня',
    '1': 'Лютага',
    '2': 'Сакавiка',
    '3': 'Красавiка',
    '4': 'Мая',
    '5': 'Червеня',
    '6': 'Лiпеня',
    '7': 'Жнiвеня',
    '8': 'Верасеня',
    '9': 'Кастрычнiка',
    '10': 'Лiстапада',
    '11': 'Снежаня',
  },
  days: {
    '0': 'Нд',
    '1': 'Пн',
    '2': 'Аў',
    '3': 'Ср',
    '4': 'Чц',
    '5': 'Пт',
    '6': 'Сб',
  },
  weekDays: {
    '0': 'Нядзеля',
    '1': 'Панядзелак',
    '2': 'Аўторак',
    '3': 'Серада',
    '4': 'Чацвер',
    '5': 'Пятніца',
    '6': 'Субота',
  }
  }
}

export const langForMap = {
  'en': 'en_RU',
  'ru': 'ru_RU',
  'be': 'be_BY'
}

export const translationDays = {
  'sunday': {
    'ru': 'Воскресенье',
    'be': 'Нядзеля'
  },
  'monday': {
    'ru': 'Понедельник',
    'be': 'Панядзелак'
  },
  'tuesday': {
    'ru': 'Вторник',
    'be': 'Аўторак '
  },
  'wednesday': {
    'ru': 'Среда',
    'be': 'Серада'
  },
  'thursday': {
    'ru': 'Четверг',
    'be': 'Чацвер'
  },
  'friday': {
    'ru': 'Пятница',
    'be': 'Пятніца'
  },
  'saturday': {
    'ru': 'Суббота',
    'be': 'Субота'
  },
  'воскресенье': {
    'en': 'Sunday',
    'be': 'Нядзеля'
  },
  'понедельник': {
    'en': 'Monday',
    'be': 'Панядзелак'
  },
  'вторник': {
    'en': 'Tuesday',
    'be': 'Аўторак'
  },
  'среда': {
    'en': 'Wednesday',
    'be': 'Серада'
  },
  'четверг': {
    'en': 'Thursday',
    'be': 'Чацвер'
  },
  'пятница': {
    'en': 'Friday',
    'be': 'Пятніца'
  },
  'суббота': {
    'en': 'Saturday',
    'be': 'Субота'
  },
  'нядзеля': {
    'en': 'Sunday',
    'ru': 'Воскресенье'
  },
  'панядзелак': {
    'en': 'Monday',
    'ru': 'Понедельник'
  },
  'аўторак': {
    'en': 'Tuesday',
    'ru': 'Вторник'
  },
  'серада': {
    'en': 'Wednesday',
    'ru': 'Среда'
  },
  'чацвер': {
    'en': 'Thursday',
    'ru': 'Четверг'
  },
  'пятніца': {
    'en': 'Friday',
    'ru': 'Пятница'
  },
  'субота': {
    'en': 'Saturday',
    'ru': 'Суббота'
  },
}
